# Taps
tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jason0x43/neovim-nightly"
tap "koekeishiya/formulae"

# brews
brew "atool"
brew "bat"
brew "xz"
brew "python@3.9"
brew "awscli"
brew "choose-gui"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "docker"
brew "editorconfig"
brew "elinks"
brew "gnutls"
brew "exiftool"
brew "harfbuzz"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "graphviz"
brew "grep"
brew "highlight"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libcaca"
brew "libtensorflow@1"
brew "llvm"
brew "lynx"
brew "media-info"
brew "mono"
brew "neofetch"
brew "numpy"
brew "pyqt@5"
brew "sip"
brew "opencv"
brew "picocom"
brew "plantuml"
brew "poppler"
brew "prettier"
brew "ripgrep"
brew "s3fs"
brew "sphinx"
brew "subversion"
brew "the_silver_searcher"
brew "tmux"
brew "transmission-cli"
brew "trash-cli"
brew "vim"
brew "w3m"
brew "wget"
brew "eddieantonio/eddieantonio/imgcat"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"


# Casks
cask "alacritty"
cask "discord"
cask "docker"
cask "firefox"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "meetingbar"
cask "neovim-nightly"
cask "nightowl"
cask "notion"
cask "osxfuse"
cask "scroll-reverser"
cask "spotify"
cask "spotmenu"
cask "vlc"
cask "xbar"
cask "zoom"
